mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xb/common/s6e1a1xb.h
/*******************************************************************************
* \file		s6e1a1xb.h
* 
* \version  1.0
*
* \date		7/29/2016
*
* \brief	CMSIS Core Peripheral Access Layer Header File for s6e1a1xb Device
*
********************************************************************************
* Copyright 2016, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
* CYPRESS PROVIDES THIS SOFTWARE "AS IS" AND MAKES NO WARRANTY
* OF ANY KIND, EXPRESS OR IMPLIED, WITH REGARD TO THIS SOFTWARE,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
* MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR
* PURPOSE.
*******************************************************************************/

#ifndef _S6E1A1XB_H_
#define _S6E1A1XB_H_
#define __S6E1A1XB_H__
#define __S6E1A1_H__

#if defined __cplusplus
extern "C" {
#endif

#define FM_GENERAL_MCUHEADER_VERSION              0201


#ifndef FM_DEVICE_PACKAGE_S6E_B
#define FM_DEVICE_PACKAGE_S6E_B
#endif 

/*******************************************************************************
* Configuration of the Cortex-M4 Processor and Core Peripherals
*******************************************************************************/
#define FM0P_DEVICE_TYPE                          1
#define FM_DEVICE_TYPE                            0101u
#define FM_CORE_TYPE_FM0P                         1
#define __CM0PLUS_REV                             0x0001
#define __MPU_PRESENT                             0
#define __NVIC_PRIO_BITS                          2
#define __Vendor_SysTickConfig                    0
#define __FPU_PRESENT                             0
#define __FPU_DP                                  0
#define __ICACHE_PRESENT                          0
#define __DCACHE_PRESENT                          0
#define __DTCM_PRESENT                            0

/*******************************************************************************
* Peripheral Types
*******************************************************************************/
#define FM0P_ADC_TYPE_A                           1
#define FM0P_BT_TYPE_A                            1
#define FM0P_BTIOSEL03_TYPE_A                     1
#define FM0P_CLK_GATING_TYPE_A                    1
#define FM0P_CRC_TYPE_A                           1
#define FM0P_CRG_TYPE_A                           1
#define FM0P_CRTRIM_TYPE_A                        1
#define FM0P_DMAC_TYPE_A                          1
#define FM0P_DS_TYPE_A                            1
#define FM0P_DT_TYPE_A                            1
#define FM0P_EXTI_TYPE_A                          1
#define FM0P_FASTIO_TYPE_A                        1
#define FM0P_FLASH_IF_TYPE_A                      1
#define FM0P_GPIO_TYPE_A                          1
#define FM0P_HWWDT_TYPE_A                         1
#define FM0P_INTREQ_TYPE_1_A                      1
#define FM0P_LSCRP_TYPE_A                         1
#define FM0P_LVD_TYPE_A                           1
#define FM0P_MFS_TYPE_A                           1
#define FM0P_MFT_TYPE_A                           1
#define FM0P_MFT_PPG_TYPE_A                       1
#define FM0P_MTB_DWT_TYPE_A                       1
#define FM0P_QPRC_TYPE_A                          1
#define FM0P_QPRC_NF_TYPE_A                       1
#define FM0P_RTC_TYPE_A                           1
#define FM0P_SBSSR_TYPE_A                         1
#define FM0P_SWWDT_TYPE_A                         1
#define FM0P_UNIQUE_ID_TYPE_A                     1
#define FM0P_WC_TYPE_A                            1

/*******************************************************************************
* Available Peripherals
*******************************************************************************/
#define FM0P_ADC_AVAILABLE                        1
#define FM_ADC_AVAILABLE                          1
#define FM0P_BT_AVAILABLE                         1
#define FM_BT_AVAILABLE                           1
#define FM0P_BT_PPG_AVAILABLE                     1
#define FM_BT_PPG_AVAILABLE                       1
#define FM0P_BT_PWC_AVAILABLE                     1
#define FM_BT_PWC_AVAILABLE                       1
#define FM0P_BT_PWM_AVAILABLE                     1
#define FM_BT_PWM_AVAILABLE                       1
#define FM0P_BT_RT_AVAILABLE                      1
#define FM_BT_RT_AVAILABLE                        1
#define FM0P_BTIOSEL03_AVAILABLE                  1
#define FM_BTIOSEL03_AVAILABLE                    1
#define FM0P_CLK_GATING_AVAILABLE                 1
#define FM_CLK_GATING_AVAILABLE                   1
#define FM0P_CRC_AVAILABLE                        1
#define FM_CRC_AVAILABLE                          1
#define FM0P_CRG_AVAILABLE                        1
#define FM_CRG_AVAILABLE                          1
#define FM0P_CRTRIM_AVAILABLE                     1
#define FM_CRTRIM_AVAILABLE                       1
#define FM0P_DMAC_AVAILABLE                       1
#define FM_DMAC_AVAILABLE                         1
#define FM0P_DS_AVAILABLE                         1
#define FM_DS_AVAILABLE                           1
#define FM0P_DT_AVAILABLE                         1
#define FM_DT_AVAILABLE                           1
#define FM0P_EXTI_AVAILABLE                       1
#define FM_EXTI_AVAILABLE                         1
#define FM0P_FASTIO_AVAILABLE                     1
#define FM_FASTIO_AVAILABLE                       1
#define FM0P_FLASH_IF_AVAILABLE                   1
#define FM_FLASH_IF_AVAILABLE                     1
#define FM0P_GPIO_AVAILABLE                       1
#define FM_GPIO_AVAILABLE                         1
#define FM0P_HWWDT_AVAILABLE                      1
#define FM_HWWDT_AVAILABLE                        1
#define FM0P_INTREQ_AVAILABLE                     1
#define FM_INTREQ_AVAILABLE                       1
#define FM0P_LSCRP_AVAILABLE                      1
#define FM_LSCRP_AVAILABLE                        1
#define FM0P_LVD_AVAILABLE                        1
#define FM_LVD_AVAILABLE                          1
#define FM0P_MFS_AVAILABLE                        1
#define FM_MFS_AVAILABLE                          1
#define FM0P_MFS_CSIO_AVAILABLE                   1
#define FM_MFS_CSIO_AVAILABLE                     1
#define FM0P_MFS_I2C_AVAILABLE                    1
#define FM_MFS_I2C_AVAILABLE                      1
#define FM0P_MFS_LIN_AVAILABLE                    1
#define FM_MFS_LIN_AVAILABLE                      1
#define FM0P_MFS_UART_AVAILABLE                   1
#define FM_MFS_UART_AVAILABLE                     1
#define FM0P_MFT_AVAILABLE                        1
#define FM_MFT_AVAILABLE                          1
#define FM0P_MFT_ADCMP_AVAILABLE                  1
#define FM_MFT_ADCMP_AVAILABLE                    1
#define FM0P_MFT_FRT_AVAILABLE                    1
#define FM_MFT_FRT_AVAILABLE                      1
#define FM0P_MFT_ICU_AVAILABLE                    1
#define FM_MFT_ICU_AVAILABLE                      1
#define FM0P_MFT_OCU_AVAILABLE                    1
#define FM_MFT_OCU_AVAILABLE                      1
#define FM0P_MFT_PPG_AVAILABLE                    1
#define FM_MFT_PPG_AVAILABLE                      1
#define FM0P_MFT_WFG_AVAILABLE                    1
#define FM_MFT_WFG_AVAILABLE                      1
#define FM0P_MTB_DWT_AVAILABLE                    1
#define FM_MTB_DWT_AVAILABLE                      1
#define FM0P_QPRC_AVAILABLE                       1
#define FM_QPRC_AVAILABLE                         1
#define FM0P_QPRC_NF_AVAILABLE                    1
#define FM_QPRC_NF_AVAILABLE                      1
#define FM0P_RTC_AVAILABLE                        1
#define FM_RTC_AVAILABLE                          1
#define FM0P_SBSSR_AVAILABLE                      1
#define FM_SBSSR_AVAILABLE                        1
#define FM0P_SWWDT_AVAILABLE                      1
#define FM_SWWDT_AVAILABLE                        1
#define FM0P_UNIQUE_ID_AVAILABLE                  1
#define FM_UNIQUE_ID_AVAILABLE                    1
#define FM0P_WC_AVAILABLE                         1
#define FM_WC_AVAILABLE                           1

