mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1a1xb/common/s6e1a1xb.h
#define bFM_BT3_RT_TMCR_STRG                      *((volatile  uint8_t *)(0x424A1980UL))
#define bFM0P_BT3_RT_TMCR_STRG                    *((volatile  uint8_t *)(0x424A1980UL))
#define bFM_BT3_RT_TMCR_CTEN                      *((volatile  uint8_t *)(0x424A1984UL))
#define bFM0P_BT3_RT_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A1984UL))
#define bFM_BT3_RT_TMCR_MDSE                      *((volatile  uint8_t *)(0x424A1988UL))
#define bFM0P_BT3_RT_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A1988UL))
#define bFM_BT3_RT_TMCR_OSEL                      *((volatile  uint8_t *)(0x424A198CUL))
#define bFM0P_BT3_RT_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A198CUL))
#define bFM_BT3_RT_TMCR_T32                       *((volatile  uint8_t *)(0x424A199CUL))
#define bFM0P_BT3_RT_TMCR_T32                     *((volatile  uint8_t *)(0x424A199CUL))

#define bFM_BT3_RT_TMCR2_CKS3                     *((volatile  uint8_t *)(0x424A1A20UL))
#define bFM0P_BT3_RT_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A1A20UL))
#define bFM_BT3_RT_TMCR2_GATE                     *((volatile  uint8_t *)(0x424A1A3CUL))
#define bFM0P_BT3_RT_TMCR2_GATE                   *((volatile  uint8_t *)(0x424A1A3CUL))


/*******************************************************************************
* BTIOSEL03 Registers BTIOSEL03
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* CLK_GATING Registers CLK_GATING
*   Bitband Section
*******************************************************************************/
#define bFM_CLK_GATING_CKEN0_MFSCK0               *((volatile  uint8_t *)(0x42782000UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK0             *((volatile  uint8_t *)(0x42782000UL))
#define bFM_CLK_GATING_CKEN0_MFSCK1               *((volatile  uint8_t *)(0x42782004UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK1             *((volatile  uint8_t *)(0x42782004UL))
#define bFM_CLK_GATING_CKEN0_MFSCK2               *((volatile  uint8_t *)(0x42782008UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK2             *((volatile  uint8_t *)(0x42782008UL))
#define bFM_CLK_GATING_CKEN0_MFSCK3               *((volatile  uint8_t *)(0x4278200CUL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK3             *((volatile  uint8_t *)(0x4278200CUL))
#define bFM_CLK_GATING_CKEN0_MFSCK4               *((volatile  uint8_t *)(0x42782010UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK4             *((volatile  uint8_t *)(0x42782010UL))
#define bFM_CLK_GATING_CKEN0_MFSCK5               *((volatile  uint8_t *)(0x42782014UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK5             *((volatile  uint8_t *)(0x42782014UL))
#define bFM_CLK_GATING_CKEN0_MFSCK6               *((volatile  uint8_t *)(0x42782018UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK6             *((volatile  uint8_t *)(0x42782018UL))
#define bFM_CLK_GATING_CKEN0_MFSCK7               *((volatile  uint8_t *)(0x4278201CUL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK7             *((volatile  uint8_t *)(0x4278201CUL))
#define bFM_CLK_GATING_CKEN0_MFSCK8               *((volatile  uint8_t *)(0x42782020UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK8             *((volatile  uint8_t *)(0x42782020UL))
#define bFM_CLK_GATING_CKEN0_MFSCK9               *((volatile  uint8_t *)(0x42782024UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK9             *((volatile  uint8_t *)(0x42782024UL))
#define bFM_CLK_GATING_CKEN0_MFSCK10              *((volatile  uint8_t *)(0x42782028UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK10            *((volatile  uint8_t *)(0x42782028UL))
#define bFM_CLK_GATING_CKEN0_MFSCK11              *((volatile  uint8_t *)(0x4278202CUL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK11            *((volatile  uint8_t *)(0x4278202CUL))
#define bFM_CLK_GATING_CKEN0_MFSCK12              *((volatile  uint8_t *)(0x42782030UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK12            *((volatile  uint8_t *)(0x42782030UL))
#define bFM_CLK_GATING_CKEN0_MFSCK13              *((volatile  uint8_t *)(0x42782034UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK13            *((volatile  uint8_t *)(0x42782034UL))
#define bFM_CLK_GATING_CKEN0_MFSCK14              *((volatile  uint8_t *)(0x42782038UL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK14            *((volatile  uint8_t *)(0x42782038UL))
#define bFM_CLK_GATING_CKEN0_MFSCK15              *((volatile  uint8_t *)(0x4278203CUL))
#define bFM0P_CLK_GATING_CKEN0_MFSCK15            *((volatile  uint8_t *)(0x4278203CUL))
#define bFM_CLK_GATING_CKEN0_ADCCK0               *((volatile  uint8_t *)(0x42782040UL))
#define bFM0P_CLK_GATING_CKEN0_ADCCK0             *((volatile  uint8_t *)(0x42782040UL))
#define bFM_CLK_GATING_CKEN0_ADCCK1               *((volatile  uint8_t *)(0x42782044UL))
#define bFM0P_CLK_GATING_CKEN0_ADCCK1             *((volatile  uint8_t *)(0x42782044UL))
#define bFM_CLK_GATING_CKEN0_ADCCK2               *((volatile  uint8_t *)(0x42782048UL))
#define bFM0P_CLK_GATING_CKEN0_ADCCK2             *((volatile  uint8_t *)(0x42782048UL))
#define bFM_CLK_GATING_CKEN0_ADCCK3               *((volatile  uint8_t *)(0x4278204CUL))
#define bFM0P_CLK_GATING_CKEN0_ADCCK3             *((volatile  uint8_t *)(0x4278204CUL))
#define bFM_CLK_GATING_CKEN0_DMACK                *((volatile  uint8_t *)(0x42782060UL))
#define bFM0P_CLK_GATING_CKEN0_DMACK              *((volatile  uint8_t *)(0x42782060UL))
#define bFM_CLK_GATING_CKEN0_DSTCCK               *((volatile  uint8_t *)(0x42782064UL))
#define bFM0P_CLK_GATING_CKEN0_DSTCCK             *((volatile  uint8_t *)(0x42782064UL))
#define bFM_CLK_GATING_CKEN0_GIOCK                *((volatile  uint8_t *)(0x42782070UL))
#define bFM0P_CLK_GATING_CKEN0_GIOCK              *((volatile  uint8_t *)(0x42782070UL))

#define bFM_CLK_GATING_CKEN1_BTMCK0               *((volatile  uint8_t *)(0x42782200UL))
#define bFM0P_CLK_GATING_CKEN1_BTMCK0             *((volatile  uint8_t *)(0x42782200UL))
#define bFM_CLK_GATING_CKEN1_BTMCK1               *((volatile  uint8_t *)(0x42782204UL))
#define bFM0P_CLK_GATING_CKEN1_BTMCK1             *((volatile  uint8_t *)(0x42782204UL))
#define bFM_CLK_GATING_CKEN1_BTMCK2               *((volatile  uint8_t *)(0x42782208UL))
#define bFM0P_CLK_GATING_CKEN1_BTMCK2             *((volatile  uint8_t *)(0x42782208UL))
#define bFM_CLK_GATING_CKEN1_BTMCK3               *((volatile  uint8_t *)(0x4278220CUL))
#define bFM0P_CLK_GATING_CKEN1_BTMCK3             *((volatile  uint8_t *)(0x4278220CUL))
#define bFM_CLK_GATING_CKEN1_MFTCK0               *((volatile  uint8_t *)(0x42782220UL))
#define bFM0P_CLK_GATING_CKEN1_MFTCK0             *((volatile  uint8_t *)(0x42782220UL))
#define bFM_CLK_GATING_CKEN1_MFTCK1               *((volatile  uint8_t *)(0x42782224UL))
#define bFM0P_CLK_GATING_CKEN1_MFTCK1             *((volatile  uint8_t *)(0x42782224UL))
#define bFM_CLK_GATING_CKEN1_MFTCK2               *((volatile  uint8_t *)(0x42782228UL))
#define bFM0P_CLK_GATING_CKEN1_MFTCK2             *((volatile  uint8_t *)(0x42782228UL))
#define bFM_CLK_GATING_CKEN1_MFTCK3               *((volatile  uint8_t *)(0x4278222CUL))
#define bFM0P_CLK_GATING_CKEN1_MFTCK3             *((volatile  uint8_t *)(0x4278222CUL))
#define bFM_CLK_GATING_CKEN1_QDUCK0               *((volatile  uint8_t *)(0x42782240UL))
#define bFM0P_CLK_GATING_CKEN1_QDUCK0             *((volatile  uint8_t *)(0x42782240UL))
#define bFM_CLK_GATING_CKEN1_QDUCK1               *((volatile  uint8_t *)(0x42782244UL))
#define bFM0P_CLK_GATING_CKEN1_QDUCK1             *((volatile  uint8_t *)(0x42782244UL))
#define bFM_CLK_GATING_CKEN1_QDUCK2               *((volatile  uint8_t *)(0x42782248UL))
#define bFM0P_CLK_GATING_CKEN1_QDUCK2             *((volatile  uint8_t *)(0x42782248UL))
#define bFM_CLK_GATING_CKEN1_QDUCK3               *((volatile  uint8_t *)(0x4278224CUL))
#define bFM0P_CLK_GATING_CKEN1_QDUCK3             *((volatile  uint8_t *)(0x4278224CUL))

#define bFM_CLK_GATING_CKEN2_USBCK0               *((volatile  uint8_t *)(0x42782400UL))
#define bFM0P_CLK_GATING_CKEN2_USBCK0             *((volatile  uint8_t *)(0x42782400UL))
#define bFM_CLK_GATING_CKEN2_USBCK1               *((volatile  uint8_t *)(0x42782404UL))
#define bFM0P_CLK_GATING_CKEN2_USBCK1             *((volatile  uint8_t *)(0x42782404UL))
#define bFM_CLK_GATING_CKEN2_CANCK0               *((volatile  uint8_t *)(0x42782410UL))
#define bFM0P_CLK_GATING_CKEN2_CANCK0             *((volatile  uint8_t *)(0x42782410UL))
#define bFM_CLK_GATING_CKEN2_CANCK1               *((volatile  uint8_t *)(0x42782414UL))
#define bFM0P_CLK_GATING_CKEN2_CANCK1             *((volatile  uint8_t *)(0x42782414UL))
#define bFM_CLK_GATING_CKEN2_ICCCK0               *((volatile  uint8_t *)(0x42782430UL))
#define bFM0P_CLK_GATING_CKEN2_ICCCK0             *((volatile  uint8_t *)(0x42782430UL))
#define bFM_CLK_GATING_CKEN2_ICCCK1               *((volatile  uint8_t *)(0x42782434UL))
#define bFM0P_CLK_GATING_CKEN2_ICCCK1             *((volatile  uint8_t *)(0x42782434UL))
#define bFM_CLK_GATING_CKEN2_I2SCCK0              *((volatile  uint8_t *)(0x42782438UL))
#define bFM0P_CLK_GATING_CKEN2_I2SCCK0            *((volatile  uint8_t *)(0x42782438UL))
#define bFM_CLK_GATING_CKEN2_I2SCCK1              *((volatile  uint8_t *)(0x4278243CUL))
#define bFM0P_CLK_GATING_CKEN2_I2SCCK1            *((volatile  uint8_t *)(0x4278243CUL))
#define bFM_CLK_GATING_CKEN2_LCDCCK               *((volatile  uint8_t *)(0x42782440UL))
#define bFM0P_CLK_GATING_CKEN2_LCDCCK             *((volatile  uint8_t *)(0x42782440UL))
#define bFM_CLK_GATING_CKEN2_CECCK                *((volatile  uint8_t *)(0x42782448UL))
#define bFM0P_CLK_GATING_CKEN2_CECCK              *((volatile  uint8_t *)(0x42782448UL))
#define bFM_CLK_GATING_CKEN2_PCRCCK               *((volatile  uint8_t *)(0x42782450UL))
#define bFM0P_CLK_GATING_CKEN2_PCRCCK             *((volatile  uint8_t *)(0x42782450UL))

#define bFM_CLK_GATING_MRST0_MFSRST0              *((volatile  uint8_t *)(0x42782080UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST0            *((volatile  uint8_t *)(0x42782080UL))
#define bFM_CLK_GATING_MRST0_MFSRST1              *((volatile  uint8_t *)(0x42782084UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST1            *((volatile  uint8_t *)(0x42782084UL))
#define bFM_CLK_GATING_MRST0_MFSRST2              *((volatile  uint8_t *)(0x42782088UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST2            *((volatile  uint8_t *)(0x42782088UL))
#define bFM_CLK_GATING_MRST0_MFSRST3              *((volatile  uint8_t *)(0x4278208CUL))
#define bFM0P_CLK_GATING_MRST0_MFSRST3            *((volatile  uint8_t *)(0x4278208CUL))
#define bFM_CLK_GATING_MRST0_MFSRST4              *((volatile  uint8_t *)(0x42782090UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST4            *((volatile  uint8_t *)(0x42782090UL))
#define bFM_CLK_GATING_MRST0_MFSRST5              *((volatile  uint8_t *)(0x42782094UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST5            *((volatile  uint8_t *)(0x42782094UL))
#define bFM_CLK_GATING_MRST0_MFSRST6              *((volatile  uint8_t *)(0x42782098UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST6            *((volatile  uint8_t *)(0x42782098UL))
#define bFM_CLK_GATING_MRST0_MFSRST7              *((volatile  uint8_t *)(0x4278209CUL))
#define bFM0P_CLK_GATING_MRST0_MFSRST7            *((volatile  uint8_t *)(0x4278209CUL))
#define bFM_CLK_GATING_MRST0_MFSRST8              *((volatile  uint8_t *)(0x427820A0UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST8            *((volatile  uint8_t *)(0x427820A0UL))
#define bFM_CLK_GATING_MRST0_MFSRST9              *((volatile  uint8_t *)(0x427820A4UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST9            *((volatile  uint8_t *)(0x427820A4UL))
#define bFM_CLK_GATING_MRST0_MFSRST10             *((volatile  uint8_t *)(0x427820A8UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST10           *((volatile  uint8_t *)(0x427820A8UL))
#define bFM_CLK_GATING_MRST0_MFSRST11             *((volatile  uint8_t *)(0x427820ACUL))
#define bFM0P_CLK_GATING_MRST0_MFSRST11           *((volatile  uint8_t *)(0x427820ACUL))
#define bFM_CLK_GATING_MRST0_MFSRST12             *((volatile  uint8_t *)(0x427820B0UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST12           *((volatile  uint8_t *)(0x427820B0UL))
#define bFM_CLK_GATING_MRST0_MFSRST13             *((volatile  uint8_t *)(0x427820B4UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST13           *((volatile  uint8_t *)(0x427820B4UL))
#define bFM_CLK_GATING_MRST0_MFSRST14             *((volatile  uint8_t *)(0x427820B8UL))
#define bFM0P_CLK_GATING_MRST0_MFSRST14           *((volatile  uint8_t *)(0x427820B8UL))
#define bFM_CLK_GATING_MRST0_MFSRST15             *((volatile  uint8_t *)(0x427820BCUL))
#define bFM0P_CLK_GATING_MRST0_MFSRST15           *((volatile  uint8_t *)(0x427820BCUL))
#define bFM_CLK_GATING_MRST0_ADCRST0              *((volatile  uint8_t *)(0x427820C0UL))
#define bFM0P_CLK_GATING_MRST0_ADCRST0            *((volatile  uint8_t *)(0x427820C0UL))
#define bFM_CLK_GATING_MRST0_ADCRST1              *((volatile  uint8_t *)(0x427820C4UL))
#define bFM0P_CLK_GATING_MRST0_ADCRST1            *((volatile  uint8_t *)(0x427820C4UL))
#define bFM_CLK_GATING_MRST0_ADCRST2              *((volatile  uint8_t *)(0x427820C8UL))
#define bFM0P_CLK_GATING_MRST0_ADCRST2            *((volatile  uint8_t *)(0x427820C8UL))
#define bFM_CLK_GATING_MRST0_ADCRST3              *((volatile  uint8_t *)(0x427820CCUL))
#define bFM0P_CLK_GATING_MRST0_ADCRST3            *((volatile  uint8_t *)(0x427820CCUL))
#define bFM_CLK_GATING_MRST0_DMARST               *((volatile  uint8_t *)(0x427820E0UL))
#define bFM0P_CLK_GATING_MRST0_DMARST             *((volatile  uint8_t *)(0x427820E0UL))
#define bFM_CLK_GATING_MRST0_DSTCRST              *((volatile  uint8_t *)(0x427820E4UL))
#define bFM0P_CLK_GATING_MRST0_DSTCRST            *((volatile  uint8_t *)(0x427820E4UL))

#define bFM_CLK_GATING_MRST1_BTMRST0              *((volatile  uint8_t *)(0x42782280UL))
#define bFM0P_CLK_GATING_MRST1_BTMRST0            *((volatile  uint8_t *)(0x42782280UL))
#define bFM_CLK_GATING_MRST1_BTMRST1              *((volatile  uint8_t *)(0x42782284UL))
#define bFM0P_CLK_GATING_MRST1_BTMRST1            *((volatile  uint8_t *)(0x42782284UL))
#define bFM_CLK_GATING_MRST1_BTMRST2              *((volatile  uint8_t *)(0x42782288UL))
#define bFM0P_CLK_GATING_MRST1_BTMRST2            *((volatile  uint8_t *)(0x42782288UL))
#define bFM_CLK_GATING_MRST1_BTMRST3              *((volatile  uint8_t *)(0x4278228CUL))
#define bFM0P_CLK_GATING_MRST1_BTMRST3            *((volatile  uint8_t *)(0x4278228CUL))
#define bFM_CLK_GATING_MRST1_MFTRST0              *((volatile  uint8_t *)(0x427822A0UL))
#define bFM0P_CLK_GATING_MRST1_MFTRST0            *((volatile  uint8_t *)(0x427822A0UL))
#define bFM_CLK_GATING_MRST1_MFTRST1              *((volatile  uint8_t *)(0x427822A4UL))
#define bFM0P_CLK_GATING_MRST1_MFTRST1            *((volatile  uint8_t *)(0x427822A4UL))
#define bFM_CLK_GATING_MRST1_MFTRST2              *((volatile  uint8_t *)(0x427822A8UL))
#define bFM0P_CLK_GATING_MRST1_MFTRST2            *((volatile  uint8_t *)(0x427822A8UL))
#define bFM_CLK_GATING_MRST1_MFTRST3              *((volatile  uint8_t *)(0x427822ACUL))
#define bFM0P_CLK_GATING_MRST1_MFTRST3            *((volatile  uint8_t *)(0x427822ACUL))
#define bFM_CLK_GATING_MRST1_QDURST0              *((volatile  uint8_t *)(0x427822C0UL))
#define bFM0P_CLK_GATING_MRST1_QDURST0            *((volatile  uint8_t *)(0x427822C0UL))
#define bFM_CLK_GATING_MRST1_QDURST1              *((volatile  uint8_t *)(0x427822C4UL))
#define bFM0P_CLK_GATING_MRST1_QDURST1            *((volatile  uint8_t *)(0x427822C4UL))
#define bFM_CLK_GATING_MRST1_QDURST2              *((volatile  uint8_t *)(0x427822C8UL))
#define bFM0P_CLK_GATING_MRST1_QDURST2            *((volatile  uint8_t *)(0x427822C8UL))
#define bFM_CLK_GATING_MRST1_QDURST3              *((volatile  uint8_t *)(0x427822CCUL))
#define bFM0P_CLK_GATING_MRST1_QDURST3            *((volatile  uint8_t *)(0x427822CCUL))

#define bFM_CLK_GATING_MRST2_USBRST0              *((volatile  uint8_t *)(0x42782480UL))
#define bFM0P_CLK_GATING_MRST2_USBRST0            *((volatile  uint8_t *)(0x42782480UL))
#define bFM_CLK_GATING_MRST2_USBRST1              *((volatile  uint8_t *)(0x42782484UL))
#define bFM0P_CLK_GATING_MRST2_USBRST1            *((volatile  uint8_t *)(0x42782484UL))
#define bFM_CLK_GATING_MRST2_CANRST0              *((volatile  uint8_t *)(0x42782490UL))
#define bFM0P_CLK_GATING_MRST2_CANRST0            *((volatile  uint8_t *)(0x42782490UL))
#define bFM_CLK_GATING_MRST2_CANRST1              *((volatile  uint8_t *)(0x42782494UL))
#define bFM0P_CLK_GATING_MRST2_CANRST1            *((volatile  uint8_t *)(0x42782494UL))
#define bFM_CLK_GATING_MRST2_ICCRST0              *((volatile  uint8_t *)(0x427824B0UL))
#define bFM0P_CLK_GATING_MRST2_ICCRST0            *((volatile  uint8_t *)(0x427824B0UL))
#define bFM_CLK_GATING_MRST2_ICCRST1              *((volatile  uint8_t *)(0x427824B4UL))
#define bFM0P_CLK_GATING_MRST2_ICCRST1            *((volatile  uint8_t *)(0x427824B4UL))
#define bFM_CLK_GATING_MRST2_I2SCRST0             *((volatile  uint8_t *)(0x427824B8UL))
#define bFM0P_CLK_GATING_MRST2_I2SCRST0           *((volatile  uint8_t *)(0x427824B8UL))
#define bFM_CLK_GATING_MRST2_I2SCRST1             *((volatile  uint8_t *)(0x427824BCUL))
#define bFM0P_CLK_GATING_MRST2_I2SCRST1           *((volatile  uint8_t *)(0x427824BCUL))
#define bFM_CLK_GATING_MRST2_LCDCRST              *((volatile  uint8_t *)(0x427824C0UL))
#define bFM0P_CLK_GATING_MRST2_LCDCRST            *((volatile  uint8_t *)(0x427824C0UL))
#define bFM_CLK_GATING_MRST2_CECRST               *((volatile  uint8_t *)(0x427824C8UL))
#define bFM0P_CLK_GATING_MRST2_CECRST             *((volatile  uint8_t *)(0x427824C8UL))
#define bFM_CLK_GATING_MRST2_PCRCRST              *((volatile  uint8_t *)(0x427824D0UL))
#define bFM0P_CLK_GATING_MRST2_PCRCRST            *((volatile  uint8_t *)(0x427824D0UL))


